In [9]:
import pandas as pd

* Series----- 1d array
* Data Frame-----2d array(Table format,row & col)

In [10]:
a = pd.Series([])
b = pd.Series([1,2,3,45,5])
c = pd.Series((22,33,44,55))
d = pd.Series({'a':10,'b':15,'c':56,'d':12})

C:\Users\URVASHI\AppData\Local\Temp\ipykernel_15252\2723594587.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [11]:
print(type(a))

<class 'pandas.core.series.Series'>

In [12]:
print(type(b))

<class 'pandas.core.series.Series'>

In [13]:
a

Series([], dtype: float64)

In [14]:
b

0     1
1     2
2     3
3    45
4     5
dtype: int64

In [15]:
d

a    10
b    15
c    56
d    12
dtype: int64

In [17]:
import numpy as np

In [18]:
n=np.array([1,2,3,4,5])

In [19]:
x=pd.Series(n)

In [20]:
x

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [22]:
type(x)

pandas.core.series.Series

In [25]:
b=pd.Series([1,2,[11,22],33,[12,23],44,55])

In [26]:
b

0           1
1           2
2    [11, 22]
3          33
4    [12, 23]
5          44
6          55
dtype: object

In [27]:
b[0]

1

In [29]:
b[2:5]

2    [11, 22]
3          33
4    [12, 23]
dtype: object

In [30]:
d

a    10
b    15
c    56
d    12
dtype: int64

In [31]:
d[3]

12

In [32]:
d['c']

56

In [33]:
d['a':'c']

a    10
b    15
c    56
dtype: int64

In [36]:
s=pd.Series([1,2,3,4,5],index=['q','w','e','r','t'])

In [37]:
s

q    1
w    2
e    3
r    4
t    5
dtype: int64

In [56]:
s1=pd.Series([1,2,3,4,5],index=list('qwert'))

In [57]:
s1

q    1
w    2
e    3
r    4
t    5
dtype: int64

In [58]:
s1[3]

4

In [59]:
s2=pd.Series([1,2,3,4,1,3,5,5])

In [60]:
s2

0    1
1    2
2    3
3    4
4    1
5    3
6    5
7    5
dtype: int64

In [61]:
s2.value_counts()

1    2
3    2
5    2
2    1
4    1
dtype: int64

In [62]:
s.argmax()

4

In [63]:
s2.argmax()

6

In [64]:
s2.argmin()

0

In [65]:
s1.idxmax()

't'

In [66]:
s1.idxmin()

'q'

# DataFrame

In [71]:
a=pd.DataFrame()
b=pd.DataFrame([11,22,33,44,55])

In [72]:
a

Empty DataFrame
Columns: []
Index: []

In [73]:
b

    0
0  11
1  22
2  33
3  44
4  55

In [74]:
type(b)

pandas.core.frame.DataFrame

In [76]:
c = pd.DataFrame([ [1,2,3],[11,22,33],[4,5,6] ])

In [77]:
c

    0   1   2
0   1   2   3
1  11  22  33
2   4   5   6

In [78]:
c = pd.DataFrame([ [1,2,3,4,5],[11,22,33,44,55],[4,5,6,7,8],[6,7,8,9,0],[1,2,3,4,5] ])

In [79]:
c

    0   1   2   3   4
0   1   2   3   4   5
1  11  22  33  44  55
2   4   5   6   7   8
3   6   7   8   9   0
4   1   2   3   4   5

In [81]:
c.tail(2)

   0  1  2  3  4
3  6  7  8  9  0
4  1  2  3  4  5

In [85]:
 c.head(2)

    0   1   2   3   4
0   1   2   3   4   5
1  11  22  33  44  55

In [98]:
c.sample(2)

   0  1  2  3  4
4  1  2  3  4  5
2  4  5  6  7  8

In [101]:
c1 = pd.DataFrame([ [1,2],[3,4,5],[11,22],[33,np.nan,55],[4,5,'Missing',7,8]],columns=['colA','colB','colC','colD','colE' ])

In [102]:
c1

   colA  colB     colC  colD  colE
0     1   2.0     None   NaN   NaN
1     3   4.0        5   NaN   NaN
2    11  22.0     None   NaN   NaN
3    33   NaN       55   NaN   NaN
4     4   5.0  Missing   7.0   8.0

In [103]:
c1[['colC','colD']]

      colC  colD
0     None   NaN
1        5   NaN
2     None   NaN
3       55   NaN
4  Missing   7.0

In [108]:
c1[['colC','colD']].head(3) # [1:4]

   colC  colD
0  None   NaN
1     5   NaN
2  None   NaN

In [109]:
c1.shape

(5, 5)

In [114]:
c1[['colA']].max()

colA    33
dtype: int64

In [128]:
c1['new_col'] = [12,23,34,45,33]

In [129]:
c1

   colA  colB     colC  colD  colE  new_col  new_col1  new_col2
0     1   2.0     None   NaN   NaN       12        12        13
1     3   4.0        5   NaN   NaN       23        23        23
2    11  22.0     None   NaN   NaN       34        34        34
3    33   NaN       55   NaN   NaN       45        45        65
4     4   5.0  Missing   7.0   8.0       33        33        43

In [130]:
c1['new_col2'] = [13,23,34,65,43]c

In [132]:
c1['colD']=c1['new_col']+c1['new_col2']

In [133]:
c1

   colA  colB     colC  colD  colE  new_col  new_col1  new_col2
0     1   2.0     None    25   NaN       12        12        13
1     3   4.0        5    46   NaN       23        23        23
2    11  22.0     None    68   NaN       34        34        34
3    33   NaN       55   110   NaN       45        45        65
4     4   5.0  Missing    76   8.0       33        33        43

In [148]:
f=c1['colD']>60

In [149]:
c1[f]

   colA  colB     colC  colD  colE  new_col  new_col1  new_col2
2    11  22.0     None    68   NaN       34        34        34
3    33   NaN       55   110   NaN       45        45        65
4     4   5.0  Missing    76   8.0       33        33        43